tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"

# Fonts
cask 'font-fira-code'
cask 'font-mononoki'
cask 'font-inconsolata'
cask 'font-fantasque-sans-mono'

# Languages
brew "node"
brew "elm"

# Databases
brew "sqlite"

# Utils
brew "nvm"
brew "git"
brew "git-extras"
brew 'diff-so-fancy'
brew "tig"
brew "autojump"
brew "fasd"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "the_silver_searcher"
brew "fzf"
brew "exa"
brew 'mas'
brew 'mackup'
brew 'getantibody/tap/antibody'

# Applications
brew "neovim"
brew "vim"
cask "bettertouchtool"
cask "postman"
cask "sublime-text"
cask '1password'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'spectacle'
cask 'telegram'
cask 'vlc'
cask 'cold-turkey-blocker'
cask 'little-snitch'
cask 'micro-snitch'
cask 'dozer'
cask 'istat-menus'
cask 'discord'
cask 'steam'
cask 'keka'
cask 'synergy'

mas 'Amphetamine', id: 937984704
mas 'Affinity Photo', id: 824183456
mas 'Flycut', id: 442160987
mas 'Pocket', id: 568494494
mas 'External Editors For Photos', id: 1074021862
mas 'DxOOpticsProForPhotos', id: 1056077392
mas 'GIPHY CAPTURE', id: 668208984
mas 'Bear Notes', id: 1091189122

