tap "caskroom/cask"
tap "caskroom/fonts"
tap "codekitchen/dinghy"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/services"
tap "neovim/neovim"

# Fonts
cask 'font-fira-code'
cask 'font-mononoki'
cask 'font-inconsolata'

# Languages
brew "elixir"
brew "python"
brew "node"
brew "ruby"
brew "elm"
brew 'exercism'

# Databases
brew "sqlite"
brew "mysql"
brew "postgresql", restart_service: true
brew "mongodb", restart_service: true
brew "redis", restart_service: true

# Utils
brew "git"
brew "git-extras"
brew 'diff-so-fancy'
brew "tig"
brew "autojump"
brew "fasd"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "the_silver_searcher"
brew "fzf"
brew "exa"
brew 'mas'

# Applications
cask '1password'
cask 'dropbox'
cask 'vlc'
cask 'lumen'
cask 'spectacle'
cask "postman"
cask "sublime-text"
cask "bettertouchtool"
cask 'iterm2'
cask 'dash'
cask 'google-chrome'
cask 'firefox'
cask 'telegram'
brew "neovim"
brew "vim"

mas 'Amphetamine', id: 937984704
mas 'Affinity Photo', id: 824183456
mas 'Flycut', id: 442160987
mas 'Pocket', id: 568494494
mas 'External Editors For Photos', id: 1074021862
mas 'DxOOpticsProForPhotos', id: 1056077392
mas 'GIPHY CAPTURE', id: 668208984

# Cleanup
brew "ctags"
brew "direnv"
brew "jpeg"
brew "openssl"
brew "freetype"
brew "gdbm"
brew "gnu-getopt"
brew "global"
brew "icu4c"
brew "heroku"
brew "hub"
brew "hugo"
brew "xz"
brew "imagemagick"
brew "libevent"
brew "libksba"
brew "libxml2"
brew "libyaml"
brew "pcre"
brew "pkg-config"
brew "ruby-build"
brew "rbenv"
brew "unixodbc"
brew "codekitchen/dinghy/unfs3"
brew "codekitchen/dinghy/dinghy"
