tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"

# Languages
brew "deno"
brew "elm"
brew "node"

# Databases
brew "sqlite"

# Utils
brew "antibody"
brew "autojump"
brew "diff-so-fancy"
brew "exa"
brew "fasd"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "hub"
brew "mackup"
brew "mas"
brew "nvm"
brew "svn"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tree"
brew "yarn"
brew "zsh"
brew "zsh-completions"

# Fonts
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
cask "font-mononoki"
cask "font-mononoki-nerd-font"

# Applications
brew "neovim"
brew "vim"
cask "bettertouchtool"
cask "postman"
cask "sublime-text"
cask "1password"
cask "cold-turkey-blocker"
cask "dash"
cask "discord"
cask "dozer"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "keka"
cask "little-snitch"
cask "micro-snitch"
cask "ngrok"
cask "spectacle"
cask "steam"
cask "synergy"
cask "telegram"
cask "vlc"

mas "Amphetamine", id: 937984704
mas "Affinity Photo", id: 824183456
mas "Flycut", id: 442160987
mas "Pocket", id: 568494494
mas "External Editors For Photos", id: 1074021862
mas "DxOOpticsProForPhotos", id: 1056077392
mas "GIPHY CAPTURE", id: 668208984
mas "Bear Notes", id: 1091189122

